```
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.external.git: Refreshing state... [id=-]
module.aws_organization.random_string.random: Refreshing state... [id=si38]
module.aws_organization.aws_organizations_account.account: Refreshing state...
module.aws_organization.aws_organizations_account.account: Refreshing state... [id=656889719924]
module.serverless_api["example"].module.repository.github_repository.repository: Refreshing state... [id=serverless-example-api]
module.aws_logging.data.aws_caller_identity.current: Refreshing state... [id=2020-09-06 13:27:51.081017627 +0000 UTC]
module.aws_logging.data.aws_partition.current: Refreshing state... [id=2020-09-06 13:27:50.771234419 +0000 UTC]
module.aws_logging.data.aws_region.current: Refreshing state... [id=us-east-1]
module.aws_api_gateway.aws_iam_role.api_gateway_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch]
module.dns.module.dns["live"].aws_acm_certificate.apex: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/2d620bca-b6a9-4c69-b045-9874dcbf5f30]
module.dns.module.dns["nonlive"].aws_acm_certificate.subdomain_wildcard: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/46955869-b3c7-4936-b463-5caea37eb3f5]
module.dns.module.dns["live"].aws_acm_certificate.subdomain_wildcard: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/345cace1-2d73-4acc-a44f-d45752deb801]
module.dns.aws_route53_delegation_set.main: Refreshing state... [id=N00248303TX9WWXC3DUAK]
module.dns.module.dns["nonlive"].aws_acm_certificate.apex: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/8135d581-d413-41d4-986c-d9ce3a96a52a]
module.aws_logging.aws_s3_bucket.logs: Refreshing state... [id=scaffoldly-si38-logs-cloudtrail]
module.aws_logging.aws_kms_key.cloudtrail: Refreshing state... [id=f206c800-14d0-4612-86cd-bd6b80b2045e]
module.aws_logging.data.aws_iam_policy_document.bucket_policy: Refreshing state... [id=2777606739]
module.aws_api_gateway.aws_api_gateway_account.account: Refreshing state... [id=api-gateway-account]
module.aws_api_gateway.aws_iam_role_policy.api_gateway_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch:default]
module.aws_logging.aws_cloudtrail.cloudtrail: Refreshing state... [id=cloudtrail]
module.dns.module.dns["live"].aws_route53_zone.zone: Refreshing state... [id=Z09171243VWGB0AD4XJAE]
module.dns.module.dns["nonlive"].aws_route53_zone.zone: Refreshing state... [id=Z09185361UA62H9QOZ65H]
module.aws_logging.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=scaffoldly-si38-logs-cloudtrail]
module.aws_logging.aws_s3_bucket_public_access_block.logs: Refreshing state... [id=scaffoldly-si38-logs-cloudtrail]
module.dns.module.dns["nonlive"].aws_route53_record.verification_record["scaffoldly.dev"]: Refreshing state... [id=Z09185361UA62H9QOZ65H__5d42b6204724f370284a161fa6ef6dab.scaffoldly.dev._CNAME]
module.dns.module.dns["live"].aws_route53_record.verification_record["scaffold.ly"]: Refreshing state... [id=Z09171243VWGB0AD4XJAE__7442a2ae3c77e4c5d4bdc09c99cb7fd4.scaffold.ly._CNAME]
module.serverless_api["example"].module.stage["live"].aws_cloudwatch_log_group.group: Refreshing state... [id=/aws/apigateway/example-live]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_rest_api.api: Refreshing state... [id=fghfrn4x2b]
module.serverless_api["example"].module.stage["nonlive"].aws_cloudwatch_log_group.group: Refreshing state... [id=/aws/apigateway/example-nonlive]
module.serverless_api["example"].module.stage["live"].aws_cloudwatch_log_group.access_logs_group: Refreshing state... [id=/aws/apigateway/example-live-access-logs]
module.aws_api_gateway.module.domain["nonlive"].aws_api_gateway_domain_name.domain: Refreshing state... [id=api.scaffoldly.dev]
module.aws_api_gateway.module.domain["live"].aws_api_gateway_domain_name.domain: Refreshing state... [id=api.scaffold.ly]
module.serverless_api["example"].module.stage["nonlive"].aws_cloudwatch_log_group.access_logs_group: Refreshing state... [id=/aws/apigateway/example-nonlive-access-logs]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_rest_api.api: Refreshing state... [id=twevug835e]
module.aws_api_gateway.module.domain["live"].aws_route53_record.api_record: Refreshing state... [id=Z09171243VWGB0AD4XJAE_api.scaffold.ly_A]
module.aws_api_gateway.module.domain["nonlive"].aws_route53_record.api_record: Refreshing state... [id=Z09185361UA62H9QOZ65H_api.scaffoldly.dev_A]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_gateway_response.response_cors: Refreshing state... [id=aggr-fghfrn4x2b-DEFAULT_4XX]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_gateway_response.response_cors: Refreshing state... [id=aggr-twevug835e-DEFAULT_4XX]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_resource.health: Refreshing state... [id=0dnh87]
module.serverless_api["example"].module.stage["live"].aws_cloudwatch_log_group.execution_group: Refreshing state... [id=API-Gateway-Execution-Logs_twevug835e/live]
module.serverless_api["example"].module.stage["nonlive"].aws_cloudwatch_log_group.execution_group: Refreshing state... [id=API-Gateway-Execution-Logs_fghfrn4x2b/nonlive]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_resource.health: Refreshing state... [id=iwx47u]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_method.health_get: Refreshing state... [id=agm-fghfrn4x2b-0dnh87-GET]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_method.health_get: Refreshing state... [id=agm-twevug835e-iwx47u-GET]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_integration.health_get: Refreshing state... [id=agi-twevug835e-iwx47u-GET]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_method_response.health_get_response_200: Refreshing state... [id=agmr-twevug835e-iwx47u-GET-200]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_integration.health_get: Refreshing state... [id=agi-fghfrn4x2b-0dnh87-GET]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_method_response.health_get_response_200: Refreshing state... [id=agmr-fghfrn4x2b-0dnh87-GET-200]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_integration_response.health_get_response_200: Refreshing state... [id=agir-twevug835e-iwx47u-GET-200]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_integration_response.health_get_response_200: Refreshing state... [id=agir-fghfrn4x2b-0dnh87-GET-200]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_deployment.deployment: Refreshing state... [id=pgkbu1]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_deployment.deployment: Refreshing state... [id=tp3sqe]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_method_settings.settings: Refreshing state... [id=fghfrn4x2b-nonlive-*/*]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_method_settings.settings: Refreshing state... [id=twevug835e-live-*/*]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_stage.stage: Refreshing state... [id=ags-twevug835e-live]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_stage.stage: Refreshing state... [id=ags-fghfrn4x2b-nonlive]
module.serverless_api["example"].module.stage["live"].aws_api_gateway_base_path_mapping.mapping: Refreshing state... [id=api.scaffold.ly/example]
module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_base_path_mapping.mapping: Refreshing state... [id=api.scaffoldly.dev/example]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.serverless_api["example"].module.stage["live"].aws_api_gateway_base_path_mapping.mapping will be created
  + resource "aws_api_gateway_base_path_mapping" "mapping" {
      + api_id      = "twevug835e"
      + base_path   = "example"
      + domain_name = "api.scaffold.ly"
      + id          = (known after apply)
      + stage_name  = "live"
    }

  # module.serverless_api["example"].module.stage["live"].aws_api_gateway_deployment.deployment must be replaced
+/- resource "aws_api_gateway_deployment" "deployment" {
      ~ created_date  = "2020-09-06T13:22:22Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:656889719924:twevug835e/live" -> (known after apply)
      ~ id            = "pgkbu1" -> (known after apply)
      ~ invoke_url    = "https://twevug835e.execute-api.us-east-1.amazonaws.com/live" -> (known after apply)
        rest_api_id   = "twevug835e"
        stage_name    = "live"
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "bcc09b315c99add574321f9ee0f36d32218b42fd" -> "5a46e0c2213768b4f05800ceadee263ce6d1df35"
        }
    }

  # module.serverless_api["example"].module.stage["live"].aws_api_gateway_integration_response.health_get_response_200 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "health_get_response_200" {
        http_method         = "GET"
        id                  = "agir-twevug835e-iwx47u-GET-200"
        resource_id         = "iwx47u"
        response_parameters = {}
      ~ response_templates  = {
          ~ "application/json" = jsonencode(
              ~ {
                  + body       = {
                      + healthy = true
                    }
                  - healthy    = true -> null
                  + statusCode = 200
                }
            )
        }
        rest_api_id         = "twevug835e"
        status_code         = "200"
    }

  # module.serverless_api["example"].module.stage["live"].aws_api_gateway_method_settings.settings will be created
  + resource "aws_api_gateway_method_settings" "settings" {
      + id          = (known after apply)
      + method_path = "*/*"
      + rest_api_id = "twevug835e"
      + stage_name  = "live"

      + settings {
          + cache_data_encrypted                       = (known after apply)
          + cache_ttl_in_seconds                       = (known after apply)
          + caching_enabled                            = (known after apply)
          + data_trace_enabled                         = true
          + logging_level                              = "INFO"
          + metrics_enabled                            = true
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = -1
          + throttling_rate_limit                      = -1
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # module.serverless_api["example"].module.stage["live"].aws_api_gateway_stage.stage will be created
  + resource "aws_api_gateway_stage" "stage" {
      + arn                  = (known after apply)
      + deployment_id        = (known after apply)
      + execution_arn        = (known after apply)
      + id                   = (known after apply)
      + invoke_url           = (known after apply)
      + rest_api_id          = "twevug835e"
      + stage_name           = "live"
      + xray_tracing_enabled = true

      + access_log_settings {
          + destination_arn = "arn:aws:logs:us-east-1:656889719924:log-group:/aws/apigateway/example-live-access-logs"
          + format          = "$context.identity.sourceIp $context.identity.caller $context.identity.user [$context.requestTime] \"$context.httpMethod $context.resourcePath $context.protocol\" $context.status $context.responseLength $context.requestId"
        }
    }

  # module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_base_path_mapping.mapping will be created
  + resource "aws_api_gateway_base_path_mapping" "mapping" {
      + api_id      = "fghfrn4x2b"
      + base_path   = "example"
      + domain_name = "api.scaffoldly.dev"
      + id          = (known after apply)
      + stage_name  = "nonlive"
    }

  # module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_deployment.deployment must be replaced
+/- resource "aws_api_gateway_deployment" "deployment" {
      ~ created_date  = "2020-09-06T13:22:22Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:656889719924:fghfrn4x2b/nonlive" -> (known after apply)
      ~ id            = "tp3sqe" -> (known after apply)
      ~ invoke_url    = "https://fghfrn4x2b.execute-api.us-east-1.amazonaws.com/nonlive" -> (known after apply)
        rest_api_id   = "fghfrn4x2b"
        stage_name    = "nonlive"
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "16675e14fca0c6cb38a8cdb4cc1c8595820d70df" -> "63440b06f2adebe1f5d134d20bd0c6f8e5fa70a3"
        }
    }

  # module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_integration_response.health_get_response_200 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "health_get_response_200" {
        http_method         = "GET"
        id                  = "agir-fghfrn4x2b-0dnh87-GET-200"
        resource_id         = "0dnh87"
        response_parameters = {}
      ~ response_templates  = {
          ~ "application/json" = jsonencode(
              ~ {
                  + body       = {
                      + healthy = true
                    }
                  - healthy    = true -> null
                  + statusCode = 200
                }
            )
        }
        rest_api_id         = "fghfrn4x2b"
        status_code         = "200"
    }

  # module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_method_settings.settings will be created
  + resource "aws_api_gateway_method_settings" "settings" {
      + id          = (known after apply)
      + method_path = "*/*"
      + rest_api_id = "fghfrn4x2b"
      + stage_name  = "nonlive"

      + settings {
          + cache_data_encrypted                       = (known after apply)
          + cache_ttl_in_seconds                       = (known after apply)
          + caching_enabled                            = (known after apply)
          + data_trace_enabled                         = true
          + logging_level                              = "INFO"
          + metrics_enabled                            = true
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = -1
          + throttling_rate_limit                      = -1
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_stage.stage will be created
  + resource "aws_api_gateway_stage" "stage" {
      + arn                  = (known after apply)
      + deployment_id        = (known after apply)
      + execution_arn        = (known after apply)
      + id                   = (known after apply)
      + invoke_url           = (known after apply)
      + rest_api_id          = "fghfrn4x2b"
      + stage_name           = "nonlive"
      + xray_tracing_enabled = true

      + access_log_settings {
          + destination_arn = "arn:aws:logs:us-east-1:656889719924:log-group:/aws/apigateway/example-nonlive-access-logs"
          + format          = "$context.identity.sourceIp $context.identity.caller $context.identity.user [$context.requestTime] \"$context.httpMethod $context.resourcePath $context.protocol\" $context.status $context.responseLength $context.requestId"
        }
    }

Plan: 8 to add, 2 to change, 2 to destroy.

------------------------------------------------------------------------

This plan was saved to: planfile

To perform exactly these actions, run the following command to apply:
    terraform apply "planfile"

\n\n0
```